rkz/extension/Documents/ПроизводствоБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводствоБезЗаказа</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГруппыЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Documents/ПроизводствоБезЗаказа/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] +        
	
	Если ЭтотОбъект.бит_Выполнено Тогда  //ЛТ6.1.5
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства КАК ДокументПроизводства,
		|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
		|	бит_СоставИсполнителейИВремяВыполнения.Должность КАК Должность,
		|	бит_СоставИсполнителейИВремяВыполнения.Разряд КАК Разряд,
		|	бит_СоставИсполнителейИВремяВыполнения.Начисление КАК Начисление
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства = &ДокументПроизводства";
		
		Запрос.УстановитьПараметр("ДокументПроизводства", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Смена.Установить(Документы.СменноеЗадание.ПустаяСсылка());
			НаборЗаписей.Отбор.ДокументПроизводства.Установить(Ссылка);	
			НаборЗаписей.Отбор.Бригада.Установить(ВыборкаДетальныеЗаписи.Бригада);		
			НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаДетальныеЗаписи.Сотрудник);
			НаборЗаписей.Отбор.Должность.Установить(ВыборкаДетальныеЗаписи.Должность);
			НаборЗаписей.Отбор.Разряд.Установить(ВыборкаДетальныеЗаписи.Разряд);
			НаборЗаписей.Отбор.Начисление.Установить(ВыборкаДетальныеЗаписи.Начисление);
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		Для Каждого СтрокаБригады Из ЭтотОбъект.бит_СоставБригады Цикл
			
			НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.Смена.Установить(Ссылка.СменноеЗадание);
			НаборЗаписей.Отбор.ДокументПроизводства.Установить(Ссылка);
			
			Если ТипЗнч(Ссылка.бит_Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
				НаборЗаписей.Отбор.Бригада.Установить(Ссылка.бит_Исполнитель);
			КонецЕсли;
			
			НаборЗаписей.Отбор.Сотрудник.Установить(СтрокаБригады.Сотрудник);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаБригады.Должность);
			НаборЗаписей.Отбор.Разряд.Установить(СтрокаБригады.Разряд);
			НаборЗаписей.Отбор.Начисление.Установить(СтрокаБригады.Начисление);
			
			Запись = НаборЗаписей.Добавить();
			//Запись.Смена = Ссылка.СменноеЗадание;
			Запись.ДокументПроизводства = Ссылка;
			
			Если ТипЗнч(Ссылка.бит_Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
				Запись.Бригада = Ссылка.бит_Исполнитель;
			КонецЕсли;
			
			Запись.Сотрудник = СтрокаБригады.Сотрудник;
			Запись.Должность = СтрокаБригады.Должность;
			Запись.Разряд = СтрокаБригады.Разряд;
			Запись.Начисление = СтрокаБригады.Начисление;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		
		//НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		//
		//Если ТипЗнч(ЭтотОбъект.бит_Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	
		//	НоваяЗапись = НаборЗаписей.Добавить();
		//	
		//	НоваяЗапись.Регистратор = Ссылка;               
		//	НоваяЗапись.ОперацияВыпуска = Ссылка;
		//	НоваяЗапись.Сотрудник = ЭтотОбъект.бит_Исполнитель;
		//	
		//	//Часы Норма рассчитывается значение из вида работ указанного на вкладке "Трудозатраты" в реквизите "(бит) Время выполнения" * на Количество. 
		//	//Если нет установленных норм для соответствующего сочетания Номенклатуры/Оборудования/ТипаОперации, значение устанавливать "0" 
		//	//Количество автоматически пересчитывается по группе затрат соотнесенной с вкладкой "Продукция"
		//	
		//	НоваяЗапись.ЧасыНорма = 1;
		//	
		//	ЧасыФакт = 0;
		//	
		//	//Если ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
		//	//	ЧасыФакт = ТекСтрока.ВремяФакт / 60;
		//	//ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
		//	//	ЧасыФакт = ТекСтрока.ВремяФакт;
		//	//ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.День Тогда	
		//	//	ЧасыФакт = ТекСтрока.ВремяФакт * 24;
		//	//КонецЕсли;
		//	
		//	НоваяЗапись.ЧасыФакт = ЧасыФакт;
		//	
		//	НоваяЗапись.КоличествоПлан = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
		//	НоваяЗапись.КоличествоФакт = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
		//	
		//Иначе	
		//	
		//	Для Каждого ТекСтрока Из ЭтотОбъект.бит_СоставБригады Цикл
		//		
		//		НоваяЗапись = НаборЗаписей.Добавить();
		//		
		//		НоваяЗапись.Регистратор = Ссылка;               
		//		НоваяЗапись.ОперацияВыпуска = Ссылка;
		//		НоваяЗапись.Сотрудник = ТекСтрока.Сотрудник;
		//		
		//		//Часы Норма рассчитывается значение из вида работ указанного на вкладке "Трудозатраты" в реквизите "(бит) Время выполнения" * на Количество. 
		//		//Если нет установленных норм для соответствующего сочетания Номенклатуры/Оборудования/ТипаОперации, значение устанавливать "0" 
		//		//Количество автоматически пересчитывается по группе затрат соотнесенной с вкладкой "Продукция"
		//		
		//		НоваяЗапись.ЧасыНорма = 1;
		//		
		//		ЧасыФакт = 0;
		//		
		//		Если ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
		//			ЧасыФакт = ТекСтрока.ВремяФакт / 60;
		//		ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
		//			ЧасыФакт = ТекСтрока.ВремяФакт;
		//		ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.День Тогда	
		//			ЧасыФакт = ТекСтрока.ВремяФакт * 24;
		//		КонецЕсли;
		//		
		//		НоваяЗапись.ЧасыФакт = ЧасыФакт;
		//		
		//		НоваяЗапись.КоличествоПлан = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
		//		НоваяЗапись.КоличествоФакт = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
		//		
		//	КонецЦикла;
		//			
		//КонецЕсли;
		//
		//НаборЗаписей.Записать(); 
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] -
	
КонецПроцедуры

&После("ПриКопировании")
Процедура бит_ПриКопировании(ОбъектКопирования)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	
	ЭтотОбъект.бит_Выполнено = Ложь; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения1(Отказ, РежимПроведения)
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	Если ЭтотОбъект.бит_Выполнено Тогда
	#КонецВставки// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
	
	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ПроизводствоБезЗаказаЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
	КонецЕсли;
	#КонецВставки// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
	
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	Если ПроведениеДокументов.СвойстваДокумента(ЭтотОбъект).ЭтоНовый Тогда
		ПолучитьСсылкуНового();
	КонецЕсли;

	Если ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ЗатратыНеУказываются Тогда
		ПобочныеИзделия.Очистить();
		МатериалыИРаботы.Очистить();
		Трудозатраты.Очистить();
	КонецЕсли;

	ПараметрыОкругления = Документы.ПроизводствоБезЗаказа.ПараметрыТЧДляОкругления();
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления["ВыходныеИзделия"]);
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления["ПобочныеИзделия"]);
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления["МатериалыИРаботы"]);

	ПараметрыУказанияСерий =
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПроизводствоБезЗаказа);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ПобочныеИзделия);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.МатериалыИРаботы);

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект,
	"ВыходныеИзделия",
	"МаксимальныйКодСтрокиВыходныеИзделия");

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект,
	"Трудозатраты",
	"МаксимальныйКодСтрокиТрудозатраты");

	НайденныеСтроки = ВыходныеИзделия.НайтиСтроки(
	Новый Структура("НаправлениеВыпуска",
	Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию));
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.Назначение = Неопределено;
	КонецЦикла;

	НайденныеСтроки = ПобочныеИзделия.НайтиСтроки(
	Новый Структура("НаправлениеВыпуска",
	Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию));
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.Назначение = Неопределено;
	КонецЦикла;

	ПараметрыВыбораСтатейИАналитик = Документы.ПроизводствоБезЗаказа.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

	СтрокаТЧ = "ВыходныеИзделия,ПобочныеИзделия,МатериалыИРаботы";
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, СтрокаТЧ);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
		Если ЭтотОбъект.бит_Выполнено Тогда
		#КонецВставки// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
		
		ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров();
		ЗаполнитьВидыЗапасов(Отказ);
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] +        
		КонецЕсли;
		#КонецВставки// }}ПервыйБИТ ЛистТребований [ЛТ6.1.5] [ASHolyavko@1cbit.ru] [29.10.2025] -
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда

		Если Не ВидыЗапасовУказаныВручную Тогда
			ВидыЗапасовВыходныеИзделия.Очистить();
			ВидыЗапасовПобочныеИзделия.Очистить();
			ВидыЗапасовМатериалыИРаботы.Очистить();
		КонецЕсли;

	КонецЕсли;

	//Настройка счетов учета
	НастройкаСчетовУчетаСервер.ПередЗаписью(ЭтотОбъект,
	Документы.ПроизводствоБезЗаказа.ПараметрыНастройкиСчетовУчета());

	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());	

	ПроизводствоБезЗаказаЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если Не ЗначениеЗаполнено(Автор) И ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
